# IPerformanceAdviserRule Interface

---
C#Visual BasicVisual C++
Revit 2024 API
---
IPerformanceAdviserRule Interface
Members See Also
---
Base class to derive specific performance adviser rules from.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public interface IPerformanceAdviserRule
```

Visual Basic
---
```text
Public Interface IPerformanceAdviserRule
```

Visual C++
---
```text
public interface class IPerformanceAdviserRule
```

# See Also
IPerformanceAdviserRule Members
Autodesk.Revit.DB Namespace